nginx-https-with-let's-Encrypt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-06 一 15:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" title="Standard" href="/worg/style/worg.css" type="text/css" />
<link rel="alternate stylesheet" title="Zenburn" href="/worg/style/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="/worg/style/worg-classic.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge65b12c">nginx install or check</a></li>
</ul>
</div>
</div>
<p>
#+TITLE nginx https with let's Encrypt
</p>

<p>
Note: this article just work on Centos 7 system.
</p>

<div id="outline-container-orge65b12c" class="outline-2">
<h2 id="orge65b12c">nginx install or check</h2>
<div class="outline-text-2" id="text-orge65b12c">
<p>
if your system has not installed nginx, you should install it first.
Centos 7 system can install nginx package from Centos repository.
</p>
<ol class="org-ol">
<li><p>
Install the EPEL repository:
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo yum install epel-release
</pre>
</div></li>
<li><p>
Install nginx
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo yum install nginx
</pre>
</div></li>
</ol>
<p>
if your system had installed nginx, you should check whether it supports http<sub>ssl</sub><sub>module</sub>.
</p>
<div class="org-src-container">
<pre class="src src-shell">nginx -V | grep ssl

--with-http_ssl_module
</pre>
</div>
<p>
if not has "&#x2013;with-http<sub>ssl</sub><sub>module</sub>", you should install nginx from EPEL.
</p>

<p>
Note: For more installation information please see <a href="https://www.nginx.com/resources/admin-guide/installing-nginx-open-source">installing-nginx-open-source</a> .
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
                <script type='text/javascript'>
                    /* * * CONFIGURATION VARIABLES * * */
                    var disqus_shortname = 'callmesanye';
                    /* * * DON'T EDIT BELOW THIS LINE * * */
                    (function() {
                        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
                </script>
                <noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript>
                <p> Created by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.5) </p>
                <a href='#' class='back-to-top' id='fixed-back-to-top' style='display: inline;'></a>
</div>
</body>
</html>
